# 1 __ res ცვლადის მნიშვნელობა იქნება num list ოღონდ შებრუნებული და მისი მეორე ინდექსი იქნება 4

nums = [1, 2, 3, 4, 5, 6]
res = nums[::-1]
print(res[2])

# 2
x = input()
print(x[-1])

#3 რადგან სიაში შედის 5 მნიშვნელობა 1 ინდექსი ექნება მის მეორე კომპონენტს -1 კი ბოლოს, შესაბამისად გამოვა მეორედან ბოლომდე მე-2 მე-3 მე-4 რაც ჯამში არის 3(პ.ს print ფუნქცია არ არის მოცემული solo learn-ში და არაფერს გამოიტანს რომ იყოს ამას გამოიტანდა)
names = [1, 2, 3, 4, 5]

print(names[1:-1])

#4
num = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

print(num[-1:-6:-1])

#5 input-ით მომხმხმარებელს ვაძლევ საშუალებას შემოიტანოს სტრინგი და შემდგომ print-ით გადავცემ ბრძანებას რომელიც -1-ით revers აკეთებს
text = input()
print(text[::-1])
