# სიაში შემოტანილი არის რიცხვები შემდგომ remove ფუნქციით ამოშლილია რიცხვი 2 და შემდეგ გამოტანილია სიის სიგრძეს დამატებული სიაში რიცხვი 6ის რაოდენობა, ეს გამოიტანს 4ს

list = [8, 4, 2, 6]
list.remove(2)
print(len(list) + list.count(6))

# სიაში შემოტანილია რიცხვები და insert ფუნქციით შემოტანილია რიცხვი 3 ინდექსით 1, შემდეგ ამოშლილია 9 და insert-ით დამატებულია სიაში 8ის რაოდენობა, საბოლოოდ გაოტანილია სიის წევრი ინდექსით 3 რომელიც იქნება 4

nums = [2, 4, 8, 9, 5]

nums.insert(1, 3)
nums.remove(9)
nums.insert(0, nums.count(8))

# მოცემული იყო სია რომელშიც მოცემული იყვნენ რიგის წევრები, შემოვიტანე input რათა მომხმარებელს დაემატებინა თვისი სახელიც ამ სიაში და შემდგომ სიის სრული შემადგენლობა გამოვიტანე

queue = ['John', 'Amy', 'Bob', 'Adam']
queue.append(input('Next in queue:'))
print(queue)