# bug არის ინგლისური სიტყვა და ნიშნავს ხოჭოს, თუმცა იგი პროგრამირებაში დამკვიდრდა როგორც შეცდომის, ხარვეზის ტერმინი, მას შემდეგ რაც ერთ-ერთი პირველი კომპიუტერი, რომელიც მთლიან ოთახს იკავებდა სიდიდის გამო ხოჭომ გააფუჭა. შესაბამისად debugging არის კოდში ხარვეზის მოძებნა და გამოსწორება. 

# ტექსტური მნიშვნელობა იგივე string არსის ტექსტი რომელიც მოქცეულია ბრჭყალებში და გადაეცემა ცვლადს ან print ბრძანებას.

# რიცხვითი მნიშვნელობები არის 3 სახის integer float complex. იგი იწერება ბრჭყალების გარეშე და გადაეცემა ცვლადებსა და print ბრძანებას. int _ არის მთელი რიცხვი, float _ ათწილადი, ხოლო complex იწერება j ასოთი.

# ჩვენს გარდა კიდევ ბევრ ადამიანს ადამიანს მოუწევს ჩვენი კოდის წაკითხვა და იმისათვის, რომ ეს კოდი სხვებისთვისაც მარტივი გასაგები იყოს საჭიროა კომენტარები ვწეროთ. მაგალითად შევქმენით ფილმების საიტირომელსაც დასჭირდა 5000 კოდი და ჩვენზე გამოცდილმა პროგრამისტმა იპოვა bug კონკრეტულ ფილმზე. იმის ნაცვლად, რომ მან დაიწყოს კოდების ცალცალკე მოწმება ნახავს კოდს რომელსაც კომენტრად ურთვის ამ ფილმის სახელი და თუ კომენტარები არ იქნებოდა მას 5000 კოდის წაკითხვა დაეზარებოდა და ჩვენი bug გამოუსწორებელი დარჩებოდა.

# substitution +
print(234567820 + 98464363024827)
print(-922527 + 54789)
print(1.652372 + 5.67682812683)
print(726j + 71639j)

# subtraction -
print(823763 - 27176)
print(0 - 113248123)
print(3983.3265188 - 583.76372)
print(6532j -173j)

#multiplication *
print(378 * 'gafs')
print(7621 * 2461)
print(32.461 * 313.121713)
print(15217 * 78143732j)

#devision /
print(51821102 / 10)
print(327.7152 / 8452.323)
print(234j / 9)