alert('დაჩი ფურცხვანიძე, 14 წლის, საყვარელი მანქანა როლსროისი, საყვარელი ფერი არ მაქვს')

// 2
alert(1 + 2)
alert(2 + 3)
alert(3 + 4)
alert(4 + 5)
alert(5 + 6)
alert(6 - 5)
alert(5 - 4)
alert(4 - 3)
alert(3 - 2)
alert(2 - 1)

// 3
alert('JavaScript (JS) არის მაღალი დონის, დინამიური პროგრამირების ენა, რომელიც ძირითადად გამოიყენება ვებსაიტებზე ინტერაქტიული და დინამიური შინაარსის შესაქმნელად. იგი დეველოპერებს საშუალებას აძლევს განახორციელონ რთული ფუნქციები, როგორიცაა კონტენტის განახლება, ანიმაციები და მომხმარებლის შეყვანის დამუშავება.'
)